In [1]:
#!wget --no-check-certificate https://drive.google.com/uc?id=1zBM3idCNWceBMLKMRBTN8aVFAg5U_YH7 -O Sachin_ODI.csv

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df_sachin = pd.read_csv("Sachin_ODI.csv")
df_sachin

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,False,False
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,True,False
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,True,False
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,False,True
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,True,False

In [4]:
df_sachin.describe()

,runs,NotOut,bf,fours,sixes,sr,Inns
count,360.000000,360.000000,360.000000,360.000000,360.000000,360.000000,360.000000
mean,43.241667,0.083333,49.394444,4.858333,0.466667,75.295056,1.527778
std,42.182452,0.276770,41.348576,4.722900,1.057669,34.980677,0.499923
min,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000,1.000000
25%,8.000000,0.000000,15.000000,1.000000,0.000000,57.030000,1.000000
50%,30.000000,0.000000,35.000000,3.000000,0.000000,76.330000,2.000000
75%,67.000000,0.000000,73.500000,8.000000,1.000000,97.822500,2.000000
max,200.000000,1.000000,153.000000,25.000000,7.000000,196.550000,2.000000

#### **A match is randomly chosen, what is the probability that India have won that match?**

In [5]:
df_won = df_sachin.loc[df_sachin['Won']==True]
df_won.shape

(184, 14)

In [6]:
print("# of Matches Played: ", len(df_sachin))
print("# of Matches won: ", len(df_won))
print("Probability thatg India have won a match, when a match is picked randomly:", len(df_won)/len(df_sachin) * 100)

# of Matches Played:  360
# of Matches won:  184
Probability thatg India have won a match, when a match is picked randomly: 51.11111111111111

#### **A match is chosen at a random, what is the probability that Sachin has scored a Century in that match? (3 mins)**

In [7]:
df_century = df_sachin.loc[df_sachin['century']==True]
df_century.shape

(46, 14)

In [8]:
print("# of Matches PLayed: ", len(df_sachin))
print("# of Century:", len(df_century))
print("Probability that sachin has scored a century in randomly choosen match:", len(df_century)/len(df_sachin)*100)

# of Matches PLayed:  360
# of Century: 46
Probability that sachin has scored a century in randomly choosen match: 12.777777777777777

#### **A match is chosen at a random. What is the probability that Sachin has scored a century in that match and India have won that match?**

In [9]:
df_century_won = df_sachin.loc[(df_sachin['century']== True) & (df_sachin['Won']==True)]
df_century_won.shape

(30, 14)

In [10]:
print("# of Matches Played: ", len(df_sachin))
print("# of Matches India won when Sachin Made Century: ", len(df_century_won))
print("Probability that India won the match when Sachin made century: ", len(df_century_won) / len(df_sachin) * 100)

# of Matches Played:  360
# of Matches India won when Sachin Made Century:  30
Probability that India won the match when Sachin made century:  8.333333333333332

### **Crosstab**

In [11]:
df_crosstab = pd.crosstab(df_sachin['century'], df_sachin['Won'])
df_crosstab

Won      False  True
century
False      160    154
True        16     30

In [12]:
df_crosstab = pd.crosstab(df_sachin['century'], df_sachin['Won'], margins = True)
df_crosstab

Won      False  True  All
century
False      160   154  314
True        16    30   46
All        176   184  360

## **Bayes Theorem**

In [13]:
!wget --no-check-certificate https://drive.google.com/uc?id=1Mp2bQl5QJ6O2tcezb0ceBQIn8vW5us0N -O kerala.csv

--2025-05-28 03:29:53--  https://drive.google.com/uc?id=1Mp2bQl5QJ6O2tcezb0ceBQIn8vW5us0N
Resolving drive.google.com (drive.google.com)... 142.251.42.46, 2404:6800:4007:805::200e
Connecting to drive.google.com (drive.google.com)|142.251.42.46|:443... connected.
HTTP request sent, awaiting response... 303 See Other
Location: https://drive.usercontent.google.com/download?id=1Mp2bQl5QJ6O2tcezb0ceBQIn8vW5us0N [following]
--2025-05-28 03:29:54--  https://drive.usercontent.google.com/download?id=1Mp2bQl5QJ6O2tcezb0ceBQIn8vW5us0N
Resolving drive.usercontent.google.com (drive.usercontent.google.com)... 142.250.192.33, 2404:6800:4007:804::2001
Connecting to drive.usercontent.google.com (drive.usercontent.google.com)|142.250.192.33|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 10300 (10K) [application/octet-stream]
Saving to: ‘kerala.csv’

kerala.csv          100%[===================>]  10.06K  --.-KB/s    in 0.01s

2025-05-28 03:29:57 (975 KB/s) - ‘kerala.csv’ saved [10300/10300]

In [ ]:
df = pd.read